EDT/УТ/src/Reports/ОтчетАгентаЯндекс/ОтчетАгентаЯндекс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетАгентаЯндекс</name>
</mdclass:Report>

EDT/УТ/src/InformationRegisters/ОтветственныеЛицаОрганизации/ОтветственныеЛицаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛицаОрганизации</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственноеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ОтветственныеЛицаОрганизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ПараметрыПечатиОтчетовАгента/ПараметрыПечатиОтчетовАгента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыПечатиОтчетовАгента</name>
  <resources>
    <name>ВариантПечати</name>
    <type>
      <types>EnumRef.ВариантыПечатиОтчетовАгента</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ВариантыПечатиОтчетовАгента/ВариантыПечатиОтчетовАгента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПечатиОтчетовАгента</name>
  <enumValues>
    <name>ПринциалАгент</name>
  </enumValues>
  <enumValues>
    <name>АгентСубагент</name>
  </enumValues>
  <enumValues>
    <name>ЗаказчикИсполнитель</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ОтветственныеЛицаОрганизации/ОтветственныеЛицаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтветственныеЛицаОрганизации</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Руководитель</name>
  </enumValues>
  <enumValues>
    <name>ГлавныйБухгалтер</name>
  </enumValues>
  <enumValues>
    <name>Кассир</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>(Общ)</comment>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИМНС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПлательщикаПриПеречисленииНалогов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВРегламентированномУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетСБП</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнформированияДляПечатиЧеков</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>assist_MerchantId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>assist_login</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>assist_password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиAssistПоТерминалам</name>
    <attributes>
      <name>РегионДоставки</name>
      <type>
        <types>CatalogRef.РегиональныеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>MerchantId</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>login</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>password</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаРождения</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛичногоТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.зпГруппыФизлиц</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНетМонет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/КонтактныеЛицаКонтрагентов/КонтактныеЛицаКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛицаКонтрагентов</name>
  <comment>Контактные лица контрагентов</comment>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РольКонтактногоЛица</name>
    <type>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/РолиКонтактныхЛиц/РолиКонтактныхЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиКонтактныхЛиц</name>
  <comment>(Упр)</comment>
  <predefined>
    <items>
      <name>Гендиректор</name>
      <description>Гендиректор</description>
    </items>
    <items>
      <name>Директор</name>
      <description>Директор</description>
    </items>
    <items>
      <name>ИндивидуальныйПредприниматель</name>
      <description>Индивид. предприниматель</description>
    </items>
    <items>
      <name>КоммерческийДиректор</name>
      <description>Коммерческий директор</description>
    </items>
    <items>
      <name>Менеджер</name>
      <description>Менеджер</description>
    </items>
  </predefined>
</mdclass:Catalog>

EDT/УТ/src/Reports/ОтчетАгентаЯндекс/ManagerModule.bsl
Функция СформироватьСтрокуЗаголовка(Знач ГоловнойКонтрагент, Знач НачальнаяДатаОтчета, Знач КонечнаяДатаОтчета) Экспорт
	
	ДанныеДляПечати = СобратьДанныеДляПечати(ГоловнойКонтрагент, КонечнаяДатаОтчета);
	Заказчик =  ДанныеДляПечати.КонтрагентСтрокойПолный;
	Исполнитель =  ДанныеДляПечати.ОрганизацияСтрокойПолный; 
	СтрокаЗаголовка = "Заказчик:		" + Заказчик + "
	|Исполнитель:		" + Исполнитель;
	
	Возврат СтрокаЗаголовка;
	
КонецФункции

Функция СформироватьСтрокуПодзаголовка(Знач ГоловнойКонтрагент, Знач НачальнаяДатаОтчета, Знач КонечнаяДатаОтчета) Экспорт
	
	ДанныеДляПечати = СобратьДанныеДляПечати(ГоловнойКонтрагент,КонечнаяДатаОтчета);
	ПринципалСтрокой = ДанныеДляПечати.КонтрагентСтрокой;
	
	СтрокаЗаголовка = ПринципалСтрокой + ", именуемое в дальнейшем Заказчик, в лице ______________________________________, с одной стороны, и " + 
	СокрЛП(ДанныеДляПечати.Организация)  + ", именуемое в дальнейшем Исполнитель, в лице " + ДанныеДляПечати.ДолжностьРуководителяОрганизацииВлице + " " + ДанныеДляПечати.ФИОРуководителяВлице + 
	", действующего на основании Устава, с другой стороны, именуемые в дальнейшем ""Стороны"", настоящим Отчетом удостоверяют, " + 
	"что в соответствии с условиями  Договора  в период с "+Формат(НачальнаяДатаОтчета,"ДФ='d MMMM yyyy "" г.""'")+" по "+Формат(КонечнаяДатаОтчета,"ДФ='d MMMM yyyy "" г.""'")+" были осуществлены следующие услуги:";
	
	Возврат СтрокаЗаголовка;
	
КонецФункции

Функция СформироватьСтрокуПодзаголовкаОтчет3(ГоловнойКонтрагент, Знач НачальнаяДатаОтчета, Знач КонечнаяДатаОтчета) Экспорт
	
	ДанныеДляПечати = СобратьДанныеДляПечати(ГоловнойКонтрагент,КонечнаяДатаОтчета);
	ПринципалСтрокой = ДанныеДляПечати.КонтрагентСтрокой;
	
	СтрокаЗаголовка = ПринципалСтрокой + ", именуемое в дальнейшем Заказчик, в лице ______________________________________, с одной стороны, и " + 
	СокрЛП(ДанныеДляПечати.Организация)  + ", именуемое в дальнейшем Исполнитель, в лице " + ДанныеДляПечати.ДолжностьРуководителяОрганизацииВлице + " " + ДанныеДляПечати.ФИОРуководителяВлице + 
	", действующего на основании Устава, с другой стороны, именуемые в дальнейшем ""Стороны"", подписывая настоящий Отчет удостоверяют, " + 
	"что в соответствии с условиями  Договора " + ДанныеДляПечати.АгентскийДоговор + " в период с "+Формат(НачальнаяДатаОтчета,"ДФ='d MMMM yyyy "" г.""'")+" по "+Формат(КонечнаяДатаОтчета,"ДФ='d MMMM yyyy "" г.""'")+
	" Исполнитель исполнил поручения Заказчика по приему денежных средств от Покупателей в счет оплаты за доставленные Вложения и перечислил их Заказчику в следующем размере:";
	
	Возврат СтрокаЗаголовка;
	
КонецФункции

// Возможные имена параметров:
//Организация, Агент, Параметр1, Параметр2,Руководитель, ФИОРуководителя, ФИОРуководителяВлице и т.д., все что есть в ДанныеДляПечати
Функция ЗначениеПараметраДанныхПечати(Знач ИмяПараметра, Знач ГоловнойКонтрагент, Знач НачальнаяДатаОтчета, Знач КонечнаяДатаОтчета) Экспорт
	
	ДанныеДляПечати = СобратьДанныеДляПечати(ГоловнойКонтрагент,КонечнаяДатаОтчета);
	Если ДанныеДляПечати.Свойство(ИмяПараметра) Тогда
		Возврат ДанныеДляПечати[ИмяПараметра];
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции	

Функция СобратьДанныеДляПечати(Знач Контрагент,Знач КонДата) Экспорт
	
    ДанныеДляПечати = Новый Структура;   
    ВариантПечати = ПолучитьПараметрыПечатиОтчетаКонтрагента(Контрагент);
    Если ВариантПечати = Перечисления.ВариантыПечатиОтчетовАгента.ПринциалАгент Тогда
        Параметр1 = "Принципал"; 
        Параметр2 = "Агент";
	ИначеЕсли ВариантПечати = Перечисления.ВариантыПечатиОтчетовАгента.АгентСубагент Тогда
		Параметр1 = "Агент"; 
		Параметр2 = "Субагент";
	Иначе
        Параметр1 = "Заказчик"; 
        Параметр2 = "Исполнитель";
    КонецЕсли; 
    ДанныеДляПечати.Вставить("Параметр1",Параметр1);
    ДанныеДляПечати.Вставить("Параметр2",Параметр2);
    
    Отбор = Новый Структура();
    Отбор.Вставить("Контрагент",Контрагент);
    Отбор.Вставить("ТипОплаты",Справочники.ТипыОплат.Наличные);
    Отбор.Вставить("ТипДоставки", Перечисления.ТипыЗаказов.Доставка);
	
	ОрганизацияДоставки	= Контрагент.ОсновнойДоговорКонтрагента.Организация;
	
	Если ЗначениеЗаполнено(ОрганизацияДоставки) Тогда
		Агент = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ОрганизацияДоставки, КонДата),"ПолноеНаименование,ИНН,КПП");
		Организация = ОрганизацияДоставки;
	Иначе
		Организация = Справочники.Организации.ПустаяСсылка();
		Агент = "";	
	КонецЕсли;	
	
    ДанныеДляПечати.Вставить("Организация",Организация);
	ДанныеДляПечати.Вставить("ОрганизацияСтрокой",ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ОрганизацияДоставки, КонДата),"ПолноеНаименование"));
	ДанныеДляПечати.Вставить("ОрганизацияСтрокойПолный",ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ОрганизацияДоставки, КонДата),"ПолноеНаименование,ИНН,КПП"));

    ДанныеДляПечати.Вставить("Агент", Агент);
    
	КонтрагентСтрокой = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Контрагент, КонДата), "ПолноеНаименование");
	ДанныеДляПечати.Вставить( "КонтрагентСтрокой",КонтрагентСтрокой);
	
	КонтрагентСтрокойПолный = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Контрагент, КонДата), "ПолноеНаименование,ИНН,КПП");
	ДанныеДляПечати.Вставить( "КонтрагентСтрокойПолный",КонтрагентСтрокойПолный);

	
    Отбор = Новый Структура();
    Отбор.Вставить("СтруктурнаяЕдиница",Организация);
    Отбор.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);
    ЗаписьРегистра = РегистрыСведений.ОтветственныеЛицаОрганизации.СрезПоследних(КонДата,Отбор);
    Если ЗаписьРегистра.Количество()>0 Тогда
        РуководительСсылка = ЗаписьРегистра[0].ФизическоеЛицо;
        ФИО = ФормированиеПечатныхФорм.ФамилияИмяОтчество(РуководительСсылка,КонДата);
        ФИОруководителя =  ФИО.Фамилия +" " + ФИО.Имя +" "+ ФИО.Отчество ;
		
		ФИОРуководителяВлице = ПолучитьСклонениеСтроки(ФИОРуководителя, "ПЛ="+СокрЛП(РуководительСсылка.Пол), "ПД=Родительный");

		СоставФИО = СтрРазделить(ФИОРуководителяВлице," ");
		ФИОРуководителяВлице =  СоставФИО[0]+" "+Лев(ФИО.Имя,1)+". "+Лев(ФИО.Отчество,1)+".";
		
		ФИОруководителя =  ФИО.Фамилия+" "+Лев(ФИО.Имя,1)+". "+Лев(ФИО.Отчество,1)+".";
        
        ДолжностьРуководителяОрганизации = ЗаписьРегистра[0].Должность;	
        ДолжностьРуководителяОрганизацииВлице  = ПросклонятьФразуПоСловам(СокрЛП(ДолжностьРуководителяОрганизации.Наименование),"ПД=Родительный");
    Иначе
       РуководительСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();
       ФИОРуководителя = "";
       ФИОРуководителяВлице = "";
       ДолжностьРуководителяОрганизации = Справочники.ДолжностиОрганизаций.ПустаяСсылка();
       ДолжностьРуководителяОрганизацииВлице = "";
   КонецЕсли;
   
    ДанныеДляПечати.Вставить("Руководитель",РуководительСсылка);
    ДанныеДляПечати.Вставить("ФИОРуководителя",ФИОруководителя);
    ДанныеДляПечати.Вставить("ФИОРуководителяВлице",ФИОРуководителяВлице);
    ДанныеДляПечати.Вставить("ДолжностьРуководителяОрганизации",ДолжностьРуководителяОрганизации);
    ДанныеДляПечати.Вставить("ДолжностьРуководителяОрганизацииВлице",ДолжностьРуководителяОрганизацииВлице);
    
	ДанныеДляПечати.Вставить("АгентскийДоговор",СокрЛП(Контрагент.ОсновнойДоговорКонтрагента.Номер) + " от " + Формат(Контрагент.ОсновнойДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy")); //Задача № 2724 
	
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	КонтактныеЛицаКонтрагентов.Наименование КАК ИмяЛица,
                   |	КонтактныеЛицаКонтрагентов.РольКонтактногоЛица.Наименование КАК Должность,
                   |	КонтактныеЛицаКонтрагентов.КонтактноеЛицо.Фамилия + "" "" + КонтактныеЛицаКонтрагентов.КонтактноеЛицо.Имя + "" "" + КонтактныеЛицаКонтрагентов.КонтактноеЛицо.Отчество КАК ФИО,
                   |	КонтактныеЛицаКонтрагентов.КонтактноеЛицо.Пол КАК Пол,
                   |	КонтактныеЛицаКонтрагентов.КонтактноеЛицо.Фамилия КАК Фамилия,
                   |	КонтактныеЛицаКонтрагентов.КонтактноеЛицо.Имя КАК Имя,
                   |	КонтактныеЛицаКонтрагентов.КонтактноеЛицо.Отчество КАК Отчество
                   |ИЗ
                   |	Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
                   |ГДЕ
                   |	КонтактныеЛицаКонтрагентов.РольКонтактногоЛица В(&РолиКонтактныхЛиц)
                   |	И КонтактныеЛицаКонтрагентов.Владелец = &Владелец
                   |	И НЕ КонтактныеЛицаКонтрагентов.ПометкаУдаления";
    РолиКонтактныхЛиц = Новый СписокЗначений;
    РолиКонтактныхЛиц.Добавить(Справочники.РолиКонтактныхЛиц.Гендиректор);
    РолиКонтактныхЛиц.Добавить(Справочники.РолиКонтактныхЛиц.Директор);
    РолиКонтактныхЛиц.Добавить(Справочники.РолиКонтактныхЛиц.ИндивидуальныйПредприниматель);
    РолиКонтактныхЛиц.Добавить(Справочники.РолиКонтактныхЛиц.КоммерческийДиректор);
    РолиКонтактныхЛиц.Добавить(Справочники.РолиКонтактныхЛиц.Менеджер);
	
	ЗамГенДиректора = Справочники.РолиКонтактныхЛиц.НайтиПоКоду("000000008");
	Если Не ЗамГенДиректора.Ссылка.Пустая() Тогда
		
		РолиКонтактныхЛиц.Добавить(ЗамГенДиректора);

	КонецЕсли;
	
    Запрос.УстановитьПараметр("РолиКонтактныхЛиц",РолиКонтактныхЛиц);                   
    Запрос.УстановитьПараметр("Владелец", Контрагент);	
    Выборка = Запрос.Выполнить().Выбрать();
    Работник = "";
    ФизЛицоПол = "";
    Имя  ="";
    Отчество = "";
    ДиректорПринципалаВЛице = "";
    Если Выборка.Следующий() Тогда
        Должность = Выборка.Должность;
		НаименованиеДолжности = СокрЛП(Должность);
		НаименованиеДолжности = ?(НаименованиеДолжности = "ИП","индивидуальный предприниматель",НаименованиеДолжности);

        ДолжностьВЛице = ПросклонятьФразуПоСловам(НаименованиеДолжности,"ПД=Родительный");
        ФИОПринципала = Выборка.ФИО;
        Пол = Выборка.Пол;
        Работник = Выборка.Фамилия;
        Имя = Выборка.Имя;
        Отчество = Выборка.Отчество;
        ФизЛицоПол = Пол;
    КонецеСли;
    РезультатСклонения = "";
	
	ДиректорПринципалаВЛице = ПолучитьСклонениеСтроки(Работник,СокрЛП(ФизЛицоПол), "ПД=Родительный");
	
	ДиректорПринципалаВЛице = ДиректорПринципалаВЛице+" "+Лев(Имя,1)+". "+Лев(Отчество,1)+".";
    ДанныеДляПечати.Вставить("Должность",Должность);
    ДанныеДляПечати.Вставить("ДолжностьВлице",ДолжностьВЛице);
    ДанныеДляПечати.Вставить("ДиректорПринципала",Работник+" "+Лев(Имя,1)+". "+Лев(Отчество,1)+".");
    ДанныеДляПечати.Вставить("ДиректорПринципалаВЛице",ДиректорПринципалаВЛице);
    
    Возврат ДанныеДляПечати
    
КонецФункции // СобратьДанныеДляПечати()

Функция СуммаНДСВСумме(Знач Сумма, Знач КонечнаяДатаОтчета) Экспорт
	
	СтавкаНДСДляОтчета = Отчеты.ОтчетАгента.ЗначениеСтавкиНСДДляРасчетаУслуг(КонецДня(КонечнаяДатаОтчета));
	КоэффВыделенияНДС = СтавкаНДСДляОтчета/(100+СтавкаНДСДляОтчета);
	КоэффНачисленияНДС = СтавкаНДСДляОтчета/100;

	СуммаНДС = Окр(Сумма*КоэффВыделенияНДС, 2);
	Возврат СуммаНДС;
	
КонецФункции

Функция СуммаНДССверху(Знач Сумма, Знач КонечнаяДатаОтчета) Экспорт
	
	СтавкаНДСДляОтчета = Отчеты.ОтчетАгента.ЗначениеСтавкиНСДДляРасчетаУслуг(КонецДня(КонечнаяДатаОтчета));
	КоэффВыделенияНДС = СтавкаНДСДляОтчета/(100+СтавкаНДСДляОтчета);
	КоэффНачисленияНДС = СтавкаНДСДляОтчета/100;

	СуммаНДС = Окр(Сумма*КоэффНачисленияНДС, 2);
	Возврат СуммаНДС;
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСклонениеСтроки(Слово,Пол = Неопределено, Падеж)
	СклоненияСтроки = ПолучитьСклоненияСтроки(Слово,Пол, Падеж);
	Возврат СклоненияСтроки[0];
КонецФункции

Функция ПросклонятьФразуПоСловам(Знач ИсходнаяСтрока, Падеж) Экспорт

    Результат = "";

    ИсходнаяСтрока = СокрЛП(ИсходнаяСтрока);
    Если СтрДлина(ИсходнаяСтрока) = 0 Тогда
        Возврат Результат;
    КонецЕсли;

    Поз = Найти(ИсходнаяСтрока, " ");
    Пока Поз > 0 Цикл

        СловоВПадеже = "";

        Слово = Лев(ИсходнаяСтрока, Поз-1);
		Если Слово = "директора" Тогда Слово = "директор" КонецЕсли;
		
		СловоВПадеже = ПолучитьСклонениеСтроки(Слово,,Строка(Падеж));

        Результат = СокрЛП(Результат + " " + НРег(СловоВПадеже));
        ИсходнаяСтрока = СокрЛП(Сред(ИсходнаяСтрока, Поз));

        Если ПустаяСтрока(ИсходнаяСтрока) Тогда
            Прервать; // Это перестраховка. Цикл и так должен прерваться
        КонецЕсли;

        Поз = Найти(ИсходнаяСтрока, " ");
    КонецЦикла;

	Если НЕ ПустаяСтрока(ИсходнаяСтрока) Тогда // добавляем заключительное слово
		Если ИсходнаяСтрока = "директора" Тогда ИсходнаяСтрока = "директор" КонецЕсли;
		
        СловоВПадеже = "";
		СловоВПадеже = ПолучитьСклонениеСтроки(ИсходнаяСтрока, ,Строка(Падеж));

        Результат = СокрЛП(Результат + " " + НРег(СловоВПадеже));

    КонецЕсли;
    Возврат Результат;

КонецФункции

Функция ПолучитьПараметрыПечатиОтчетаКонтрагента (Контрагент)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ПараметрыПечатиОтчетовАгента.ВариантПечати
    |ИЗ
    |   РегистрСведений.ПараметрыПечатиОтчетовАгента КАК ПараметрыПечатиОтчетовАгента
    |ГДЕ
    |   ПараметрыПечатиОтчетовАгента.Контрагент В (&Контрагент)";
    
    Запрос.УстановитьПараметр("Контрагент", Контрагент);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Если ВыборкаДетальныеЗаписи.Следующий() Тогда
        Возврат ВыборкаДетальныеЗаписи.ВариантПечати;
    Иначе
        Возврат Перечисления.ВариантыПечатиОтчетовАгента.ПринциалАгент;
    КонецЕсли;;
КонецФункции

Функция ФорматНомераПлатежногоДокумента(Знач Номер) Экспорт
	
	Номер = Прав(Номер,6);
	Попытка
		Номер = Число(Номер);
		Возврат Формат(Номер,"ЧГ=");
	Исключение
		Возврат Номер;
	КонецПопытки;
	
КонецФункции

#КонецОбласти
